tests/Requests/__snapshots__/G115BulkVerifyPacksRequestTest__testXml__1.txt

<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope" xmlns:urn="urn:wsdltypes.nmvs.eu:v4.0" xmlns:urn1="urn:types.nmvs.eu:v4.0"><soap:Header/><soap:Body><urn:G115Request><urn1:Header><urn1:Auth><urn1:ClientLoginId>BOND</urn1:ClientLoginId><urn1:UserId>007</urn1:UserId><urn1:Password>secret</urn1:Password></urn1:Auth><urn1:UserSoftware urn1:supplier="NGT" urn1:name="NMVS Integration" urn1:version="1.0.0"/><urn1:Transaction><urn1:ClientTrxId>trxId</urn1:ClientTrxId><urn1:Language>eng</urn1:Language></urn1:Transaction></urn1:Header><urn1:Body><urn1:Product><urn1:ProductCode urn1:scheme="GTIN">1234567890</urn1:ProductCode><urn1:Batch><urn1:Id>BATCH</urn1:Id><urn1:ExpDate>200101</urn1:ExpDate></urn1:Batch></urn1:Product><urn1:Packs><urn1:Pack urn1:sn="pack1"/><urn1:Pack urn1:sn="pack2"/></urn1:Packs></urn1:Body></urn:G115Request></soap:Body></soap:Envelope>